app/views/cart/createOrder.html.erb

<% session[:cart].each { ⎪id, count⎪ %>
    <%= Item.find(id).title %> - <%	 count %> times <br >
---
SELECT "items".* FROM "items" WHERE "items"."id" = 1 LIMIT 1