app/views/items/_categoryDistinctList.html.erb

<% @items = Item.select('DISTINCT category') %>
---
SELECT DISTINCT category FROM "items"