app/controllers/cart_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 5 ORDER BY "users"."id" ASC LIMIT 1
INSERT INTO "orders" ("created_at", "updated_at", "user_id") VALUES (?, ?, ?)  [["created_at", Fri, 06 Dec 2013 19:49:43 UTC +00:00], ["updated_at", Fri, 06 Dec 2013 19:49:43 UTC +00:00], ["user_id", 13]]
SELECT "items".* FROM "items" WHERE "items"."id" = 1 LIMIT 1
INSERT INTO "orderitems" ("created_at", "item_id", "order_id", "price", "quantity", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def createOrder
    # Step 1: Get the current user
    @user = User.find(current_user.id)
# Step 2: Create a new order and associate it with the current user
    @order = @user.orders.build(:order_date => DateTime.now)
    @order.save

# Step 3: For each item in the cart, create a new item on the order!!
    @cart = session[:cart] || {} # Get the content of the Cart
    @cart.each do | id, quantity |
      item = Item.find_by_id(id)
      @orderitem = @order.orderitems.build(
          :item_id => item.id,
          :title => item.title,
          :description => item.description,
          :quantity => quantity,
          :price => item.price
      )
      @orderitem.save