app/controllers/items_controller.rb

INSERT INTO "items" ("category", "created_at", "description", "image_url", "price", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save

SELECT "items".* FROM "items" WHERE "items"."category" = 'Cups'
---
  def category
    @items= Item.find_all_by_category(params[:id])

SELECT "items".* FROM "items" WHERE (Title like '%cup%' or Description like '%cup%')
---
  def search
    @search_term=params[:q]
    st="%#{params[:q]}%"
    @items = Item.where("Title like ? or Description like ?", st, st)