app/controllers/profiles_controller.rb

  def myprofile
    profile = Profile.find_by_user_id(current_user.id)
    if profile.nil?
      redirect_to "/profiles/new"
    else
      @user = User.find(current_user.id)
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = 5 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 5 ORDER BY "users"."id" ASC LIMIT 1

  def new
    @user = User.find(current_user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 5 ORDER BY "users"."id" ASC LIMIT 1

  def create
    @profile = Profile.new(profile_params)

    respond_to do |format|
      if @profile.save
---
INSERT INTO "profiles" ("created_at", "mobile", "updated_at") VALUES (?, ?, ?)  [["created_at", Sat, 30 Nov 2013 21:14:31 UTC +00:00], ["mobile", "+353831598122"], ["updated_at", Sat, 30 Nov 2013 21:14:31 UTC +00:00]]

  def update
    respond_to do |format|
      if @profile.update(profile_params)
---
UPDATE "profiles" SET "firstname" = ?, "lastname" = ?, "address" = ?, "user_id" = ?, "updated_at" = ? WHERE "profiles"."id" = 1  [["firstname", "Alexis"], ["lastname", "Lesage"], ["address", "Hassumaa"], ["user_id", 1], ["updated_at", Sat, 30 Nov 2013 21:15:39 UTC +00:00]]

  def destroy
    @profile.destroy
---
DELETE FROM "profiles" WHERE "profiles"."id" = ?  [["id", 12]]