app/controllers/profiles_controller.rb

SELECT "profiles".* FROM "profiles" ORDER BY "profiles"."firstname" ASC
---
  def index
    @profiles = Profile.order( :firstname)